rottenpotatoes/app/controllers/movies_controller.rb

  def find_movies_with_same_director
      id = params[:id]
      @movie = Movie.find(id)
      director_name = @movie.director
      if director_name == nil or director_name == ''
          flash[:notice] = "'#{@movie.title}' has no director info"
          redirect_to root_path
          return
      end
      @movies = Movie.where(director: director_name)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Joe Hoh"]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "Joe Hohny"], ["updated_at", "2018-10-06 19:10:50.179858"], ["id", 1]]